/*
 * (C) 2018 LIGHTWORKS CORP.
 * システム名 : 学研アプリ
 * 注意事項 :
 */
package com.example.scheduler.controller;

import java.util.ArrayList;
import java.util.List;
import java.util.Random;

/**
 * <p>機能について短い文で「・・・。」とする。</p >
 *
 * @author NWT : gong <br />
 * 変更履歴 <br />
 * 2019/4/30 : gong: 新規<br />
 * @version 1.0
 */
public class ContentUtils {
    public static String getContent(){
        List<String> contList=new ArrayList<>();
        contList.add("人生没有如果，命运不相信假设。");
        contList.add("因为有了因为，所以有了所以，既然已成既然，何必再说何必?”忘记你所失去的，珍惜你所拥有的，未来的命运会怎样，全在于今天的努力。谁都不能苛责一个努力的生命。不管是怎样的人生，只要自己尽了最大的努力，就该无怨无悔，就无需“假如”。");
        contList.add("每个人都要记住，我们都要服从一个规律，没有人例外，叫做自作自受。每一个人，都要替自己的行为负全部的责任，你推给别人没有用，你也推不掉，谁也不会替你扛。没有人害得了你，没有人救得了你，赏识你也没有用，打击你也无济于事，一切就是自作自受。这是我们需要了解的人生规律。");
        contList.add("在人生的大舞台中，无论是谁，都不可能永远是鲜花坦途，总会有荆棘坎坷，身处顺境时，我们居安思危，路才长久。身处逆境时，我们坚守希望，才能走出困境。无论怎样，我们都是自己生命电影中的主角。命运的安排，成为我们修炼的助缘。心怀善念，坚持信仰，发扬正能量，感恩身边人，收获清净和喜悦。");
        contList.add("如果爱里没有责任，爱就变得自私。如果爱里没有节制，爱就容易放纵。如果爱里没有平等，爱就变成一种施舍。如果爱里没有尊重，爱就变成一种专制。如果爱里没有喜乐，爱就不能成为真爱。如果爱不能光明正大，爱就是罪恶的化身。");
        contList.add("拥有，只需足够就好。手表，只有一块你能判断现在几点钟;有两块反而很难确定。爱人，只有一个就能全心全意相爱，多了反而纠缠不清，到头来竹篮子打水一场空。食物，能吃好则可养身，吃多了反而伤胃。幸福不需多，心里快乐就好，追求过多的幸福，累了身体累了心，再多的幸福也是累赘。");
        contList.add("我们有时会错误地以为，得不到的，才是珍贵的，已经拥有的，都是廉价的。得不到的，因为缺少深入的了解，它只是一种美好的假象，展示给我们一个绚丽的外表。如果有那么一天，你距离它近了，知道了它的真相，你才发现，它和我们拥有的，竟是那么的相似。别把眼光停留在想象中，你拥有的，都是你的幸福。");
        contList.add("我们日常生活中的情绪起伏，都会不可避免地影响周围的人;喜怒无常，也注定会破坏别人对自己的信任。所以，懂得做人，有时候比懂得做事更重要。即使你不懂怎么为人处世，至少也要学会控制情绪，而不要让情绪控制自己。");
        contList.add("最使人疲惫的往往不是道路的遥远，而是你心中的郁闷;最使人颓废的往往不是前途的坎坷，而是你自信的丧失;最使人痛苦的往往不是生活的不幸，而是你希望的破灭;最使人绝望的往往不是挫折的打击，而是你心灵的死亡;所以我们凡事要看淡些，心放开一点，一切都会慢慢变好的。");
        contList.add("有人活了一辈子，却没真正活过一秒，他们不是追忆过去，就是在期许未来，从来没有或在当下。");
        contList.add("十字路口，我们分着走。你走我的泪，我走你的恨。");
        contList.add("人的一生无论怎样艰苦困难，都必须自己亲身经历，别人是无法代替的，生活是属于自己的。而一个人只有在真正认识和了解自己之时，才能拥有一个独立自主的性格，才有资格去选择自己的爱好和习惯，不仅要把快乐寄托在别人的身上，而是要自己去努力寻找的。学会快乐的生活，最重要的是要摆正自己的心态。其实每个人都有感情的波动，每个人都会有脆弱和坚强的一面，苦乐全凭自己的判断。");
        contList.add("因为是血肉相连的亲人。所以许多话反而就成为禁忌。交流是羞耻，亲近是羞耻。唯有通过相互苛求和中伤来表达对彼此的爱，才是理所当然。这是多么可悲的事实。");
        contList.add("他们的眼神像落日一样苍茫而深远，让我觉得沉重。不过，当我们决定了孤独地上路，一切的诅咒一切的背叛都丢在身后，我们可以倔强地微笑，难过地哭泣，可是依然把脚步继续铿锵。");
        contList.add("我想人生中最难过的事情不是一直遇不见，而是遇见了，得到了，又被拿走。");
        contList.add("想你想你想你想你想你想你想你想你想你想你想你，这十一声想你代表我是一心一意的爱你，你在我心里永远是最重要的。");
        contList.add("黑色的天空，散发着诡异的气息，空气中弥漫着压抑的感觉，那感觉让人窒息。");
        contList.add("过去被翻阅，瞬间才明白，原来，记忆已搁浅。");
        contList.add("说什么真爱无敌，敌不过你的三心二意。");
        contList.add("流光容易把人抛下，任誓言在风间流走。");
        contList.add("无论吵闹多少次，说多少伤人的话，最后还是会因为在乎对方而和好如初，这就是幸福的爱情。");
        contList.add("秋天是收获的季节给人以喜悦，秋天又是凋零的季节给人以凄楚。但在我们每一个人的心里，都有一份只属于自己的曾经的收获与快乐。就让我们伴着优美的歌声去回忆吧。");
        contList.add("天地之间，何处是我最终停靠的港湾?心中的牵绊，多愁多伤感，不变的是你的容颜!红尘漫漫，如何面对那沧海桑田的变迁?在喧嚣中，我选择和你并肩。");
        Random random=new Random();
        int n=random.nextInt(contList.size());
        return contList.get(n);
    }
}
